"""
Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
но только в том случае если они не равны None.
"""

def add(a, b, c):
    print(a, b, c)
add(int(input()), int(input()), int(input()))